{
    "categories": [
        {
            "name": "action",
            "movies": [
                "dantes-peak",
                "volcano",
                "san-andreas",
                "2012",
                "deep-impact",
                "the-core",
                "journey-center-earth",
                "godzilla-kong",
                "austin-powers"
            ]
        },
        {
            "name": "interest",
            "movies": [
                "ice-age-drift",
                "jurassic-park",
                "shawshank"
            ]
        },
        {
            "name": "real",
            "movies": [
                "free-solo",
                "impossible",
                "deepwater-horizon"
            ]
        }
    ],
    "movies": [
        {
            "id": "austin-powers",
            "title": "Austin Powers: International Man of Mystery",
            "year": 1997,
            "rating": "4/5",
            "enjoyability": "5/5",
            "realism": "2/5",
            "trailer": "https://www.youtube.com/embed/5vsANcS4Ml8",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BMTRhZTY0MDItY2I1Yi00MGE3LTk1ZDEtMjA0ZGZhNDQyNGU0XkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
            "geology": {
                "features": ["Underground drilling", "Earth's core", "Volcanic activity"],
                "location": {
                    "place": "Nevada Nuclear Test Site",
                    "country": "USA"
                },
                "analysis": "Throughout the films, Dr Evil’s plans for world domination are elaborate and absurd schemes. In this film, he tries to extort the government’s money by threatening to drill into the Earth’s core and cause geological damage on a catastrophic level. But is this really achievable?\n\nThe Earth’s core lies approximately 6,370km below the surface with solid layers of rock, mantle and an outer core surrounding it. The deepest borehole ever drilled is 12km in depth (Kola Superdeep Borehole, Russia), which set Dr Evil up for a bit of a tricky start. But let’s put some more factors in. If he were to drill deeper than 12km, then the temperatures and pressures would quickly increase. The Earth’s core can exceed 5,000 °C, which is enough to melt Dr Evil’s homemade contraption, and the pressure would crush it before it got anywhere near the core. And had he thought about the location of the drilling?\n\nIf he drilled near a volcanic hotspot or along a tectonic plate boundary, then he could’ve possibly disrupted magma chambers and increased the likelihood of an eruption. This takes precise planning and targeting, which would’ve probably exceeded the geological knowledge of Dr Evil. If he had a larger drill (one on the scale of fracking or mining), then disturbing a fault line and triggering an earthquake may have been slightly achievable. However, his operation only had a small drill that would’ve been highly unlikely to cause any noticeable seismic events.\n\nTo achieve his goal, a significant amount of energy would’ve been needed. His single villainous empire wouldn’t have been able to generate the amount needed. Even if he had a nuclear-powered drill, then drilling to the core still wouldn’t be possible.\n\nDr Evil is made as an entirely comedic character with no aspect of geology or the Earth, as proven when he describes the magma as being “liquid hot.” However, this movie was made to not be taken seriously and to exaggerate all the elaborate plans from classic spy films. Plus, it’s hard to focus on the geology when it’s comedic sketch after comedic sketch!",
               "sceneDetails": "**Key Scenes:**\n• Underground lair construction\n• Nuclear warhead placement in volcanic structures\n• Desert facility operations\n\n**Technical Details:**\nThough exaggerated for comedy, the film's underground facilities reference real geological considerations in bunker construction and nuclear testing sites."
            }
        },
        {
            "id": "jurassic-park",
            "title": "Jurassic Park",
            "year": 1993,
            "rating": "4/5",
            "enjoyability": "5/5",
            "realism": "3/5",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BMjM2MDgxMDg0Nl5BMl5BanBnXkFtZTgwNTM2OTM5NDE@._V1_.jpg",
            "trailer": "https://www.youtube.com/embed/QWBKEmWWL38",
            "geology": {
                "features": ["Amber preservation", "Fossil formation", "Sedimentary rocks"],
                "location": {
                    "place": "Dominican Republic (Amber scenes)",
                    "country": "Dominican Republic"
                },
                 "analysis": "This film is a part of the best film series of all time. Another film perfect for children who wonder about past life and the dinosaurs. But how accurate is it really? The film creates the dinosaurs with two main methods. Firstly they take paleo-DNA from the respective fossils and use that to synthesise part of the genome of the dinosaur. But the main, most intriguing concept they use is taking the blood of the dinosaurs from the inside of a mosquito that was covered in ancient tree sap which then gets lithified to form the amber. These are interesting concepts they are impossible to replicate. The covalent and hydrogen bonds found within the DNA break down overtime. It can last for tens of thousands of years at an upper limit. But, as dinosaurs went extinct 65 million years ago at the K-Pg mass extinction, we have no dinosaur DNA from any fossils. whilst it is theoretically possible for DNA to be found in a fossilised mosquito,  the plethora of conditions that would need to be met make it highly improbable. The mosquito would’ve had to have been female, consumed a very large quantity of dino blood very just before being trapped in the tree resin, had no interference from external factors as it lithified and fossilised and would have needed the correct conditions for the blood to not break down. Because of this, it is currently impossible to recreate the dinosaurs with current technology These films are a great watch. While we have no way of recreating what is seen in the film, some of what we see is theoretically possible so while it's not technically geologically inaccurate, it's not accurate either.",
                "sceneDetails": "**Key Scenes:**\n• The amber mine sequences show realistic extraction methods\n• Fossil excavation scenes demonstrate actual paleontological techniques\n\n**Technical Details:**\nThe film's attention to detail in showing how amber preserves specimens and how paleontologists work provides valuable insights into real scientific practices."
            }
        },
        {
            "id": "dantes-peak",
            "title": "Dante's Peak",
            "year": 1997,
            "rating": "5/5",
            "enjoyability": "5/5",
            "realism": "4/5",
            "trailer": "https://www.youtube.com/embed/O8HNlhVbGzY",
            "thumbnail": "https://images.moviesanywhere.com/043300701040d5a73fc8d7bb2e926144/712f6580-007e-498f-97ce-3d8bd594273c.jpg",
            "geology": {
                "features": ["Stratovolcano", "Pyroclastic flows", "Volcanic gases"],
                "location": {
                    "place": "Mount St. Helens",
                    "country": "USA"
                },
               "analysis": "A classic film that follows the fictional character volcanologist Harry Dalton as he tries to convince a city of people of the dangers of the volcano that rests just above Dante’s Peak. But how geologically accurate is it truly? \n\nWhilst the premise of the film isn’t far-fetched it is unlikely that all the other volcanologists in the film don’t notice the dangers that he does. But regardless there are a few instances where the facts become fiction. One of these takes place during the eruption of the volcano. There are several scenes in which we see large lava flows travelling at very high speeds. This is incorrect because the volcano in the film is a composite cone volcano and the lava released from this type is usually far more viscous and so travels far slower due to a much higher silica content. Obviously this is done to create a level of tension within the film however it is completely inaccurate. \n\nSecondly, before the eruption, there is a series of earthquakes that cause catastrophic damage to the surrounding city. This is also unrealistic as earthquakes that correlate with volcanic activity rarely exceed a 6 in magnitude. In today's infrastructure, there is little to no chance that an earthquake of that strength would cause that much damage. That level of earthquake would likely cause minor structural damage at best. \n\nThe most significant act of geological sacrilege in this film comes from one particular scene. When the main character tries to drive over a lava flow. As I mentioned previously, the lava of the volcano would’ve been incredibly viscous. This means that the tyres would likely get no spin as they get stuck into the lava; effectively trapping them in the middle of the lava flow. Lava ranges from temperatures of 700 to 1200 degrees Celsius. This means it would be mere seconds before the rubber on the tires is melted and they get trapped for an inevitable death. It would take minutes before the truck was entirely melted. It's bad enough that they were able to drive over it in the film but it only gets worse from there. Their truck with no tyres then proceeds to escape a pyroclastic flow keeping them alive. Pyroclastic flows travel at an average speed of 100 km/h and can reach speeds of 700 km/h. This makes it highly unlikely a truck with no wheels would escape this interaction.\n\nWhile it's a great film to watch with the family, if you are a keen geologist that needs films to be accurate. This may not be fair you.",
                "sceneDetails": "**Key Scenes:**\n• The acid lake scene accurately depicts how rising magma can acidify water bodies\n• Pyroclastic flow sequences show the true devastating speed and power of these events\n\n**Technical Details:**\nThe film's portrayal of precursor events (earthquake swarms, ground deformation, gas emissions) closely mirrors actual volcanic monitoring techniques used by the USGS."
            }
        },
        {
            "id": "the-core",
            "title": "The Core",
            "year": 2003,
            "rating": "3/5",
            "enjoyability": "3/5",
            "realism": "2/5",
            "trailer": "https://www.youtube.com/embed/LVkocdkcmAc",
            "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTonUpkjenQWI-MInC_td6OaWYP1ps8CtlR6mgvdsHFpW96kXlTd07ZI7qxTa_ZfkgvhtvQNQ",
            "geology": {
                "features": ["Earth's core", "Geomagnetic field", "Mantle composition"],
                "location": {
                    "place": "Earth's Core",
                    "country": "Global"
                },
                "analysis": "In the film, The Core (2003), the film presents a fictional scenario where the Earth's core stopped rotating, causing catastrophic events such as extreme weather and electromagnetic disturbances. To help revive this, a team of high-end scientists embark on a dangerous mission to drill down into the Earth's core and restart the rotation. While the film is highly speculative and takes significant liberties with geology and physics, it touches on real geological concepts such as the Earth's internal layers and the importance of the core's movement. \n\nThe Earth is made up of several layers: the crust, mantle, outer core, and inner core. The outer core is made up of molten metals, mainly iron and nickel, and is responsible for generating the Earth's magnetic field through its convection currents. The inner core is solid, primarily composed of iron and nickel, and is subject to immense pressure and heat. In the film, the idea that the core stops rotating is a fantastical premise that deviates from reality, as the movement of the Earth's core is driven by the planet's natural processes and is not something that could be easily interrupted. Geologically, the inner core's rotation is linked to the Earth's overall energy dynamics, including its magnetic field, but this is far from the dire consequences portrayed in the film.",
                "sceneDetails": "**Key Scenes:**\n• Visualization of Earth's different layers\n• Demonstration of magnetic field effects\n• Depiction of extreme pressure and temperature conditions\n\n**Technical Details:**\nWhile the journey itself is impossible, the film's representation of Earth's internal structure provides a starting point for discussing actual geological processes and research methods."
            }
        },
        {
            "id": "deepwater-horizon",
            "title": "Deepwater Horizon",
            "year": 2016,
            "rating": "5/5",
            "enjoyability": "4/5",
            "realism": "5/5",
            "trailer": "https://www.youtube.com/embed/8yASbM8M2vg",
            "thumbnail": "https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcS6DWa_vaasgjRYBE0xbh39DZPTvZNhEpSRebI_tDqcKUfc5o9-WghjKx6dBqvIYIAB1dqliw",
            "geology": {
                "features": ["Oil formation", "Pressure systems", "Sedimentary basins"],
                "location": {
                    "place": "Gulf of Mexico",
                    "country": "USA"
                },
                "analysis": "Deepwater Horizon (2016) is a dramatization of the 2010 BP oil spill, focusing on the catastrophic explosion that occurred on the Deepwater Horizon drilling rig in the Gulf of Mexico. The film shows the dangerous and unpredictable nature of drilling into deep-sea oil reserves, touching on real geological processes associated with deep-sea drilling.\n\nThe film’s geological element is the process of drilling into deep-sea oil reservoirs (porous, permeable rocks) beneath the ocean floor. Oil is normally taken from subterranean rock formations, which can be found in sedimentary layers deep beneath the Earth’s crust. These formations often contain pockets of oil and gas, which are pressurized and trapped by layers of impermeable rock. In Deepwater Horizon, a critical moment comes when the drilling rig hits an unexpected pressure build-up, triggering the blowout. In reality, such blowouts occur when there is a failure in the well’s pressure control systems, often due to complications like miscalculations in the rock formation’s stability or failure to properly seal the well.\n\nThe geology behind the disaster involves understanding the pressure and temperature conditions at extreme depths in the Gulf of Mexico. The geology of the region, with its deep-sea sedimentary layers, presents significant risks if the integrity of the drilling process is compromised. The film’s focus on the risks of offshore drilling underscores the challenges of dealing with the unknowns beneath the Earth’s surface, where misjudging geological conditions can lead to catastrophic consequences, as depicted by the explosion and the resulting oil spill.",
                "sceneDetails": "**Key Scenes:**\n• Detailed depiction of pressure testing procedures\n• Visualization of subsea well structures\n• Demonstration of blowout prevention systems\n\n**Technical Details:**\nThe film accurately portrays the technical challenges of drilling through various geological formations and managing extreme pressures in deep-water environments."
            }
        },
        {
            "id": "ice-age-drift",
            "title": "Ice Age: Continental Drift",
            "year": 2012,
            "rating": "4/5",
            "enjoyability": "5/5",
            "realism": "3/5",
            "trailer": "https://www.youtube.com/embed/KgMtU_BM",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BMTM3NDM5MzY5Ml5BMl5BanBnXkFtZTcwNjExMDUwOA@@._V1_.jpg",
            "geology": {
                "features": ["Continental drift", "Plate tectonics", "Pangaea breakup"],
                "location": {
                    "place": "Prehistoric Earth",
                    "country": "Global"
                },
                "analysis": "If you want a film for all the family on a Saturday night, then Ice Age: Continental Drift will be suitable for everyone, unless that is, of course, one of you is a geologist. With the aspects of plate tectonics being taken into account, the portrayal of these processes is highly inaccurate and presented in an entirely comedic and dramatic way.\n\nThe concept of Continental Drift and Plate Tectonics is shown in a dumbed but accurate, child-friendly way with the continents of the Earth moving. The lithosphere of the Earth is broken into plates which overly and float on the semi-fluid asthenosphere, allowing for the continents to move. With the period of this film being set in the Pleistocene, the continents were in positions very close to how they are in the present day.\n\nWith the concept of continental drift being accurate, the speed it happened at in the movie was not. In the movie, Scrat causes Pangaea to break up by attempting to bury an acorn. This leads to rapid drift and the continents to break up instantaneously when in reality, continental drift happens at a rate of a few centimetres per year, far too slow for a human lifetime to notice. With Pangaea being broken apart from the Jurassic period 200 Ma, by the time of the Pleistocene the continents would’ve already been broken up and Pangaea would’ve been no more. The speed and distribution of the earthquakes and volcanoes in the film show them as sudden cataclysmic events as a direct result of the continents moving, and while continents breaking up do cause these events, the scale and timing shown in the film are highly inaccurate.\n\nThere is a fictional element of Scrat causing all the geological events in an attempt to bury his acorn. In the film, he splits the continents by running on the Earth’s inner core, creates mountain ranges, and even creates the faces on Mount Rushmore. These events are all highly fictionalised and defy every known law of science ever to have been. These processes are driven by tectonic movement, erosion, and volcanic activity, which take millions of years – not a few seconds by an acorn-loving squirrel! It also shows Scrat forming the Atlantic Ocean, but this formed over 100 million years ago during the breakup of Pangaea. By the time of the Ice Age, this ocean had already fully formed.\n\nThe megafauna, of which some may have coexisted together, travel on massive landmasses which break away and travel over the ocean. Whilst smaller animals may have been able to have been transported across bodies of water on vegetation rafts, the larger animals being transported on moving continents is impossible.\n\nThis movie’s portrayal of continental drift and Pangaea being broken up is entirely fantasised and made for comedic viewing. So maybe, for an evening, the geological brain can be turned off and the story of Scrat and his acorn may come to life a bit more.",
                "sceneDetails": "**Key Scenes:**\n• Visualization of Pangaea's breakup\n• Demonstration of continental drift mechanics\n• Depiction of geological formations in motion\n\n**Technical Details:**\nThe animated sequences, while dramatized, provide an engaging introduction to actual geological processes that shaped our continents."
            }
        },
        {
            "id": "volcano",
            "title": "Volcano",
            "year": 1997,
            "rating": "2/5",
            "enjoyability": "3/5",
            "realism": "1/5",
            "trailer": "https://www.youtube.com/embed/67oe0_s9EIw?si=lfeZ6i4n3shI-3IB",
            "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQsqQ9unJjojvc4XM5ObgthNMoX58gbn_dmFW0Thp4EESlvn53eXmnDE3PGMBFPZV0UJXJq",
            "geology": {
                "features": ["Urban volcanism", "Lava flows", "Magma chambers"],
                "location": {
                    "place": "Los Angeles",
                    "country": "USA"
                },
                "analysis": "Thrilling. Dramatic. Volcanoes in Los Angeles? While this film may have you on the edge of your seat worrying if this could happen, take a step back and breathe. This film, whilst capturing the high intensity of a natural disaster, is highly fictionalised, with many aspects being very unplausible.\n\nLos Angeles is located on a plate boundary; however, it is not the right plate boundary for volcanoes. This megacity lies on the San Andreas Fault, a dextrally moving transform fault which doesn’t cause the right temperature, pressure and/or composition for magma to be produced. For a new volcano to form, specific geological features are required, such as a hot spot or a magma chamber connected to a tectonic boundary. The geographical location and geology of Los Angeles make this scenario unachievable. It is seen that magma erupts from the La Brea Tar Pits. This suggests that geothermal activity may be the cause of a volcanic eruption. This isn’t the case, however. The tar pits may have occurred naturally, but their formation was due to petroleum rising and there being no trap rock.\n\nBam! The volcanoes happen. Who could’ve predicted that? Well, volcanoes often give signs of an eruption with gas emissions, ground deformation and an increase in seismic activity, all of which can be monitored. The film didn’t quite pick up on this, with the already inaccurate volcanic eruptions happening with no prior warning. With the speed at which the eruptions happened, it comes as no surprise that the speed and destructiveness of the lava flows were too exaggerated. The flows are seen moving rapidly down the streets, engulfing cars and anything else that crosses its path. The lava in the film behaves more like something made on a £10 budget. It has an inconsistent flow rate and appearance when compared to basaltic lava, which tends to have a higher viscosity. It also has a mind of its own! It travels in unlikely directions, ignoring all of the natural topography. But can this be solved by concrete? Well, the film seems to think so with its use of concrete barriers and water to divert the flow.\n\nWith the film lacking significant scientific accuracy, it is made in a fantasised way and provides a gripping watch!",
                "sceneDetails": "**Key Scenes:**\n• Urban lava flow dynamics and behavior\n• Volcanic vent formation in city infrastructure\n• Emergency response to volcanic hazards\n\n**Technical Details:**\nWhile the setting is implausible, the film's depiction of lava behavior and volcanic processes provides insight into real volcanic hazards and mitigation strategies."
            }
        },
        {
            "id": "journey-center-earth",
            "title": "Journey to the Center of the Earth",
            "year": 2008,
            "rating": "3/5 ORE",
            "enjoyability": "3/5",
            "realism": "3/5",
            "trailer": "https://www.youtube.com/embed/iJkspWwwZLM",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BMTc0MTY3NjMxNV5BMl5BanBnXkFtZTgwMzI2ODk1MDE@._V1_.jpg",
            "geology": {
                "features": ["Earth's layers", "Cave systems", "Mineral formations"],
                "location": {
                    "place": "Iceland",
                    "country": "Iceland"
                },
                "analysis": "The movie starts with the protagonist having a dream involving the three most famous geological icons. Trilobites, tyrannosaurus rex and a very exaggerated earthquake and completely unrealistic several meter wide fissure with lava at the bottom. Our geology professor protagonist (Brendan) and nephew, Josh Hutcherson (Sean), go to Iceland after finding that Sean's dad's seismometers are all reading picking up the exact same data as when his dad (Max) went missing a decade ago. This is all fine so far, the main issue which makes the geology incorrect in this film happens when they (surprisingly) theorize the Earth is as it is in Jules Verne’s A Journey to the Center of the Earth. Upon arriving in Iceland he goes searching for information about Max's disappearance with a local mountaineer whose dad also went missing. Eventually after reaching the seismometer he immediately breaks it by violently removing it from its foundation which wasn’t the greatest idea. Especially as the fact that he ended up trapped in a cave after.\n\nIn this cave they found some interesting and questionable geology. Firstly, explosive magnesium veins line the wall, magnesium is typically mined as magnesium chloride from evaporites and then separated using electrolysis. These veins are hence most likely magnesium chloride deposited from running water, however this would not be explosive because you would not find pure magnesium metal because it is too reactive. Stalactites on the roof of the cave also provide evidence of water flow in these beds.\n\nBrendan finds some metamorphic rock, specifically schist, he announces this to his posse for no reason other than it interests him despite hanging from a rope rappelling into a deep hole. He even specifies the type of schist: green schist, garnet-containing schist, mica and garnet-containing schist. This accuracy earns the movie bonus geological accuracy points.\n\nThis hole is a hole which can only be an old mine shaft due to its shape which is likely considering a mine sits at the bottom. This mine must be the most profitable ever judging by the size of diamonds they collect and sell when they eventually resurface. Despite diamonds, emeralds and rubies lying everywhere, our protagonist excitedly announces that he has found some feldspar. Extra geology points for spotting a very common mineral before impossible minerals which are probably misidentified. For example, diamond could be quartz and emerald could be pure olivine.\n\nThey also fall through a correctly colored and textured muscovite mica floor (extra accuracy points) which perfectly shows the singular cleavage plane. Any points they gain through this are immediately lost by the following ‘hundreds of miles’ of falling to the center of the earth. They then arrive in a cavern which would collapse if not being held up and cooled by magic (see explanation in the Godzilla vs Kong section). In this world, evolution was paused at the K-Pg boundary, this is proved by the existence of dinosaurs here such as the Tyrannosaurus rex which chases Sean and the ‘cyanis rosopteryx’ (made-up dinosaur birds). The T. rex which chases them shouldn't do so, as T. rex is primarily a scavenger because it has short arms and long legs designed for endurance, not chases of hunters.\n\nThere is light down here equivalent to sunlight somehow. Whatever magical force cools the cave must be rubbish because the surrounding magma heats the cave up occasionally though frustratingly only 72 hours after our gang arrives there.\n\nFinally, Sean crosses a magical magnetic rock bridge and they ride a geyser up to the surface, without being melted, and straight out of the top of Mt. Vesuvius.",
                "sceneDetails": "**Key Scenes:**\n• Exploration of real Icelandic lava tubes\n• Demonstration of cave formation processes\n• Visualization of underground geological features\n\n**Technical Details:**\nThe film uses Iceland's actual volcanic landscapes and cave systems as a foundation for its more fantastical elements, providing authentic geological context."
            }
        },
        {
            "id": "free-solo",
            "title": "Free Solo",
            "year": 2018,
            "rating": "5/5",
            "enjoyability": "4/5",
            "realism": "5/5 ",
            "trailer": "https://www.youtube.com/embed/89H0BHXjkXI",
            "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTBZsybrQt_6HjOAYxblkdm6E5dJO7K8xHSIq70r3X4CP5HQAteuGhPT8ewzklCO0OWTeBNTA",
            "geology": {
                "features": ["Granite formation", "Rock weathering", "Glacial erosion"],
                "location": {
                    "place": "El Capitan, Yosemite",
                    "country": "USA"
                },
                "analysis": "Want a gripping film that’s going to keep you on the edge of your seat? Look no further than Free Solo, a documentary film following death-defying Alex Honnold’s free solo climb of El Capitan in Yosemite National Park. But if it wasn’t for its composition, it may not have been possible. So, what made El Capitan the perfect free solo climb?\n\nEl Capitan is made up of the coarse, crystalline igneous rock granite that slowly cooled deep within the Earth’s crust. This granite is part of the Sierra Nevada Batholith, a large collection of granite intrusions that formed in the Mesozoic Era 100-200 million years ago. These were a result of the tectonic plates being subducted underneath the North American Plate, which caused the magma to rise and solidify underground. The overlying rock was then subject to erosion and uplift, which exposed these granite formations. During the Pleistocene Epoch, glaciers carved the Yosemite valley, creating sheer cliffs, leaving El Capitan a monolith with its iconic 900m tall vertical face that Honnold decided to climb.\n\nGranite is often the choice of rock when coming to rock type for climbing due to its strength, durability and texture, providing excellent friction for trickier holds. El Capitan has different types of holds, including flakes, cracks and ledges. The cracks may be formed from cooling (cooling joints), tectonic stresses and erosion. These allow for climbing techniques such as jamming and stemming. Honnold also needed to make sure that the temperature was correct for climbing, as different temperatures can cause the monolith to expand or contract, potentially leading to the destabilisation of small flakes. Over time, the granite can become weathered, which smooths out the rock, making the holds harder to grip on to.\n\nWith the film focusing on the human side of the climb, the geological perspective of El Capitan’s formation was critical to the climb, making it one of the hardest free solo routes out there.",
                "sceneDetails": "**Key Scenes:**\n• Detailed views of El Capitan's granite face\n• Visualization of climbing routes following geological features\n• Evidence of glacial sculpting and erosion\n\n**Technical Details:**\nThe cinematography captures the intricate details of Yosemite's geology, from microscopic handholds to massive geological formations."
            }
        },
        {
            "id": "impossible",
            "title": "The Impossible",
            "year": 2012,
            "rating": "3/5",
            "enjoyability": "3/5",
            "realism": "3/5",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BMjA5NTA3NzQ5Nl5BMl5BanBnXkFtZTcwOTYxNjY0OA@@._V1_.jpg",
            "geology": {
                "features": ["Tsunamis", "Plate tectonics", "Earthquake mechanics"],
                "location": {
                    "place": "Indian Ocean",
                    "country": "Thailand"
                },
                "analysis": "The movie 2012 is based on the Mayan concept that the 21st of December 2012 marks the beginning of a new age, since it is an important date in the Mesoamerican Long Count calendar. The 21st of December 2012 was supposedly the date of forecast astronomical phenomena and alignment of planets. While this date was originally believed to be the start of a spiritual renaissance of sorts, popular media began speculating that the world would end on this date. This movie takes some of the various crazy theories surrounding the idea and turns them into a two and a half hour cgi extravaganza of gargantuan earthquakes, tsunamis and volcanic eruptions. The film naturally prioritizes the visual spectacle over geological accuracy though to what extent is this the case?\n\nThe movie begins in 2009 where our favourite geologist Adrian Helmsley visits supposedly the deepest copper mine in the world. Copper is typically mined open pit unless exceptionally high grade deposits are found, the deepest open pit mine in the world is the Bingham canyon copper mine at 1.2 km in depth. Hence it is unlikely that said east Indian mine is the deepest copper mine in the world and it is even less likely that it would be used for scientific operations requiring exceptionally deep tunnels. The scientific operation in question finds mutated neutrinos which are allegedly responsible for heating up the earth's core like a microwave which led to the events in the movie. Neutrinos are almost massless, neutral particles, not electromagnetic microwaves, generated as a byproduct of nuclear reactions to balance nuclear equations. About 100 trillion neutrinos pass through our bodies every second and do not interact with any particles in our body. Hence by their fundamental nature they cannot heat up the earth's core, which is in fact already heated by its own nuclear decay anyway.\n14 minutes in we see our first example of seismic activity with mini quakes leading to small cracks in roads. Low magnitude earthquakes happen all the time due to faulting, however they also happen as a result of intrusions such as sills and dykes forming before eruptions as can be observed in Iceland for example. 22 minutes in when the protagonists family are in yellowstone liquefaction is mentioned which is a legitimate consequence of earthquakes.\n\nThe earthquake physics is ludicrous, large fissures open very slowly across roads even when there is very little shaking which is rather humorous. This is because earthquakes do not result in deep cracks in the earth's surface, only displacement of plate boundaries by up to several centimeters per year. Notable erroneous earthquake physics include the fissure which split the supermarket, and only the supermarket in half, and of course the extended scene of the Los Angeles earthquake resulting in large blocks of the earth's crust sinking into the ocean. At least los angeles is on a plate boundary, the same cannot be said for inland las vegas which has a large several hundred meter fissure across the centre of the city.\n\nHotspots are areas where the underlying mantle is hotter than average, and if for any reason the entire world somehow becomes a hotspot you would see widespread volcanic activity. This would lead to devastating consequences for the world however not in the same way as shown in the movie. The amount of eruptions over a geologically short period of time will result in huge amounts of ash, greenhouse gas emissions, warming the earth rapidly, and so2 emissions causing acid rain. Mass extinctions are often caused in this way by flood basalts, flood basalts such as the deccan traps and notably the siberian traps at the Permo-Triassic boundary are the result of huge volcanic eruptions. A single flood basalt province may contain hundreds of thousands of cubic kilometers of basalt erupted over less than a million years. Once the magma reaches the surface, it flows rapidly across the landscape, flooding the landscape with pahoehoe lava flows. If this were to happen everywhere it would almost certainly spell the end of the world as we know it. Thankfully this will never happen outside of fiction because the amount of energy required to do this is so impossibly high that no energy source below the earth's surface could produce it.\n\nTsunamis increase in amplitude and decrease in speed significantly in shallower water so the protagonist's father on the cruise had nothing to worry about in actuality. Water obviously cannot form a flat stable surface at the altitude of Everest base camp so nonexistent water must have materialised to flood the earth to this extent.\n\nContinental plates do in fact move however much, much slower than in the movie and the final piece of semi accurate geology is the fact that the magnetic poles have both moved by several degrees and flipped, although in real life this happens on a much longer timescale. This shows that whatever realistic geology can be observed happens at an unrealistic, jumbo scale.",
                "sceneDetails": "**Key Scenes:**\n• Realistic depiction of tsunami wave behavior\n• Demonstration of water displacement effects\n• Visualization of coastal destruction patterns\n\n**Technical Details:**\nThe film's portrayal of the tsunami provides viewers with an understanding of how submarine earthquakes can trigger devastating ocean waves."
            }
        },
        {
            "id": "2012",
            "title": "2012",
            "year": 2009,
            "rating": "3/5",
            "enjoyability": "3/5",
            "realism": "3/5",
            "trailer": "https://www.youtube.com/embed/sFXGrTng0gQ",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BMTY0MjEyODQzMF5BMl5BanBnXkFtZTcwMTczMjQ4Mg@@._V1_.jpg",
            "geology": {
                "features": ["Earth's core", "Crustal displacement", "Tectonic activity"],
                "location": {
                    "place": "Global",
                    "country": "Multiple"
                },
                "analysis": "The movie 2012 is based on the Mayan concept that the 21st of December 2012 marks the beginning of a new age, since it is an important date in the Mesoamerican Long Count calendar. The 21st of December 2012 was supposedly the date of forecast astronomical phenomena and alignment of planets. While this date was originally believed to be the start of a spiritual renaissance of sorts, popular media began speculating that the world would end on this date. This movie takes some of the various crazy theories surrounding the idea and turns them into a two and a half hour cgi extravaganza of gargantuan earthquakes, tsunamis and volcanic eruptions. The film naturally prioritizes the visual spectacle over geological accuracy though to what extent is this the case?\n\nThe movie begins in 2009 where our favourite geologist Adrian Helmsley visits supposedly the deepest copper mine in the world. Copper is typically mined open pit unless exceptionally high grade deposits are found, the deepest open pit mine in the world is the Bingham canyon copper mine at 1.2 km in depth. Hence it is unlikely that said east Indian mine is the deepest copper mine in the world and it is even less likely that it would be used for scientific operations requiring exceptionally deep tunnels. The scientific operation in question finds mutated neutrinos which are allegedly responsible for heating up the earth's core like a microwave which led to the events in the movie. Neutrinos are almost massless, neutral particles, not electromagnetic microwaves, generated as a byproduct of nuclear reactions to balance nuclear equations. About 100 trillion neutrinos pass through our bodies every second and do not interact with any particles in our body. Hence by their fundamental nature they cannot heat up the earth's core, which is in fact already heated by its own nuclear decay anyway.\n14 minutes in we see our first example of seismic activity with mini quakes leading to small cracks in roads. Low magnitude earthquakes happen all the time due to faulting, however they also happen as a result of intrusions such as sills and dykes forming before eruptions as can be observed in Iceland for example. 22 minutes in when the protagonists family are in yellowstone liquefaction is mentioned which is a legitimate consequence of earthquakes.\n\nThe earthquake physics is ludicrous, large fissures open very slowly across roads even when there is very little shaking which is rather humorous. This is because earthquakes do not result in deep cracks in the earth's surface, only displacement of plate boundaries by up to several centimeters per year. Notable erroneous earthquake physics include the fissure which split the supermarket, and only the supermarket in half, and of course the extended scene of the Los Angeles earthquake resulting in large blocks of the earth's crust sinking into the ocean. At least los angeles is on a plate boundary, the same cannot be said for inland las vegas which has a large several hundred meter fissure across the centre of the city.\n\nHotspots are areas where the underlying mantle is hotter than average, and if for any reason the entire world somehow becomes a hotspot you would see widespread volcanic activity. This would lead to devastating consequences for the world however not in the same way as shown in the movie. The amount of eruptions over a geologically short period of time will result in huge amounts of ash, greenhouse gas emissions, warming the earth rapidly, and so2 emissions causing acid rain. Mass extinctions are often caused in this way by flood basalts, flood basalts such as the deccan traps and notably the siberian traps at the Permo-Triassic boundary are the result of huge volcanic eruptions. A single flood basalt province may contain hundreds of thousands of cubic kilometers of basalt erupted over less than a million years. Once the magma reaches the surface, it flows rapidly across the landscape, flooding the landscape with pahoehoe lava flows. If this were to happen everywhere it would almost certainly spell the end of the world as we know it. Thankfully this will never happen outside of fiction because the amount of energy required to do this is so impossibly high that no energy source below the earth's surface could produce it.\n\nTsunamis increase in amplitude and decrease in speed significantly in shallower water so the protagonist's father on the cruise had nothing to worry about in actuality. Water obviously cannot form a flat stable surface at the altitude of Everest base camp so nonexistent water must have materialised to flood the earth to this extent.\n\nContinental plates do in fact move however much, much slower than in the movie and the final piece of semi accurate geology is the fact that the magnetic poles have both moved by several degrees and flipped, although in real life this happens on a much longer timescale. This shows that whatever realistic geology can be observed happens at an unrealistic, jumbo scale.\n\n",
                "sceneDetails": "**Key Scenes:**\n• Visualization of crustal displacement\n• Depiction of volcanic eruptions\n• Demonstration of earthquake effects\n\n**Technical Details:**\nWhile scientifically inaccurate in scale and timing, the film illustrates the potential power of Earth's geological processes."
            }
        },
        {
            "id": "deep-impact",
            "title": "Deep Impact",
            "year": 1998,
            "rating": "3/5",
            "enjoyability": "3/5",
            "realism": "3/5",
            "trailer": "https://www.youtube.com/embed/9cqDWRIv7Mg",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BYTUwMTY1YmMtN2U5NC00YjkzLTg0YWQtZmEwNTEzZjdkNzQ2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
            "geology": {
                "features": ["Impact craters", "Tsunami formation", "Sedimentary deposits"],
                "location": {
                    "place": "Atlantic Ocean",
                    "country": "Global"
                },
                "analysis": "Deep impact is a film about a dramatic asteroid collision with Earth, this leads to massive environmental destruction.\nAlthough the move accuralty represents some aspects of impact cratering, tsunamis and sedentary deposits, it also exaggerates many geological effects for the sake of drama.\n\nACCURACIES:\nThe most scientifically accurate aspect of this film is it’s depiction of impact cratering.\nWhen a large celestial object collides with earth they create massive craters, this is due to the immense kinetic energy the asteroid generates as it travels through space, which is then transferred into its destructive nature upon impact.\nThe initial explosion and after following firestorms within the film align with the real life predictions of such an event.\nThis films portrayal of how the asteroid strike would generate shock waves, intense heat and vast, widespread destruction is definitely one of the more accurate parts of this film.\n\nAnother strength of this film is that it depict tsunamis in a very good manner.\nThe size of the tsunami’s depend on the vastness of the impact created by the celestial object.\nA high-velocity celestial impact can create vast amount of water to be displaced, therefore creating waves that can cover whole ocean basins.\nIn the film a fragment of a comet makes impact on Earth, the fragment lands somewhere within the Atlantic Ocean.\nThis impact causes a massive tsunami that engulfs the coastal cities on the Atlantic shore.\nThis is scientificall plausable as impacts caused by such high-veocility celestial objects can cause vast tsunamis that could potentially reach heights of hundreds of metres.\nThe tsunami’s, of course, reduce in size as they near shorelines, but still would cause vast levels of damage and flooding.\n\nFinally the film has accuratly described the sedimentary deposits left behind the tsunami/asteroid.\nIn real-life events, massive waves transport huge amounts of debris, sands and other material like trees etc.\nThese therefore, once deposited, create distinct layers within the geological record.\nPrevious sedimentary deposits (known as tsunami sediments and impact ejecta) have provided sufficient evidence for past asteroid collisions on Earth.\n\nINACCURACIES:\n\nThis film suuggests that an asteroid that landed in the ocean would create an extinction level event due to the tsunami’s they would generate.\nWhile such waves would cause massive devestation to local coastal cities.\nThe real dangers lie in the threat from it’s atmospheric effects.\nA large asteroid impact would throw enormous amounts of dust and vaporized rock into the atmosphere, this would lead to wide-spread climate disruption.\nThis film downplays this long-term consequence a lot.\n\nFinally, the film exaggerates the tsunami sequence.\nWhile an impact-generated tsunami from an asteroid would be of an enormous size, it would not be formed in a perfect uniform towering wave.\nRather than just one enormous wave, real-world physics and past, smaller scale experiences would suggest it would be more like a series of surging floods.\n\nIn conclusion, Deep Impact portrays many geological effects accuratly, however it is guilty of simplifying the key details for the sake of cinematic impact and entertainment.",
                "sceneDetails": "**Key Scenes:**\n• Visualization of impact crater formation\n• Demonstration of tsunami generation\n• Depiction of atmospheric effects\n\n**Technical Details:**\nThe film's portrayal of impact effects provides insights into how such events have shaped Earth's geological history."
            }
        },
        {
            "id": "shawshank",
            "title": "The Shawshank Redemption",
            "year": 1994,
            "rating": "5/5",
            "enjoyability": "5/5",
            "realism": "4/5",
            "trailer": "https://www.youtube.com/embed/PLl99DlL6b4",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BNDE3ODcxYzMtY2YzZC00NmNlLWJiNDMtZDViZWM2MzIxZDYwXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_.jpg",
            "geology": {
                "features": ["Rock types", "Erosion processes", "Tunnel formation"],
                "location": {
                    "place": "Shawshank Prison",
                    "country": "USA"
                },
                "analysis": "An incredible film based on older prison life. That navigates the experiences of the main character as he is sentenced to life in prison after being wrongly accused of murder. Who then is forced into doing illegal things for a corrupt Warden using his previous occupation as a banker. An incredible film, but what relevance to geology does it have?\n\nWhile the film doesn’t go into significant detail about many geological topics, the main character is avidly interested in Geology. He is seen in one of his first interactions in prison picking up pieces of Mica and Feldspar. As he develops relationships in prison life, he manages to get his hands on a rock hammer through one of the inmates and uses his time to make many sculptures out of different minerals. He then uses this rock hammer to make his great escape after digging for many many years.\n\nOne of the main plot points comes about when the main character (Andy Dufresne) is talking to his closest friend (Red) in prison. He talks about a glassy black volcanic rock beneath a tree that has something hidden underneath. Geologist among you probably recognised immediately that it was going to be a large piece of obsidian, which ends up being true, and giving the film a heartwarming ending which ties together the values of the film such as hope and friendship.\n\nWhile this film doesn’t have much geological content, there are no inaccuracies within the science which makes it far more enjoyable to watch for those with a geological brain.",
                "sceneDetails": "**Key Scenes:**\n• Depiction of rock weathering\n• Demonstration of material erosion\n• Visualization of tunnel formation through different rock types\n\n**Technical Details:**\nThe film's portrayal of rock excavation provides insight into geological processes and material properties."
            }
        },
        {
            "id": "godzilla-kong",
            "title": "Godzilla vs. Kong",
            "year": 2021,
            "rating": "3/5",
            "enjoyability": "4/5",
            "realism": "2/5",
            "trailer": "https://www.youtube.com/embed/odM92ap8_c0",
            "thumbnail": "https://m.media-amazon.com/images/M/MV5BZmYzMzU4NjctNDI0Mi00MGExLWI3ZDQtYzQzYThmYzc2ZmNjXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg",
            "geology": {
                "features": ["Hollow Earth theory", "Underground caverns", "Tectonic activity"],
                "location": {
                    "place": "Hollow Earth and various locations",
                    "country": "Global"
                },
                "analysis": "Whilst this movie certainly does not have a particularly geological plotline, it does revolve around a dubious theory about the internal structure of the earth. Other questions such as how and if such large creatures can fossilise can also be brought up. So exactly how wrong is geology in these movies.\n\nThe gigantic monsters in this world come from ‘the center of the earth’ presented in the movies as a surface-like environment with impossible gravity and vegetation on both the roof and the floor of a large cavern which bends around the earth's core. Naturally, even a layman could tell you that this is blatantly impossible, but what would happen if whatever magical force was maintaining this status quo was to cease? Depending on just how close to the earth's core the cavern is, different things would happen. In both the inner core and the mantle, the sudden decompression of rock caused by the cavern would cause the rock above and below to instantly melt and expand to fill the gap. Because the melting point of minerals is controlled by both temperature and pressure, the high pressure, up to 360 GPa at the earth's core, means that despite temperature being equally high (5000 degrees C), the rock, or iron in the case of the core, is kept solid. Pressure will decrease as the mantle relaxes very slightly to account for the missing gap, and little would be observed at the surface. The movie also suggests there exists a network of point-to-point tunnels. Even if a short tunnel could be formed due to running water dissolving soluble minerals in the same way a cave is formed, it would certainly not be point-to-point in the way modern man-made tunnels are. Long tunnels would be prone to damage due to faulting, tensile, bending, and shearing forces without engineered mitigation methods.\n\nDinosaurs were the last creatures to grow to remotely comparable sizes as these organisms. In fact, they prove that terrestrial life is possible at gigantic sizes. Whilst Godzilla takes this to another level, some of the smaller titans in the movie are comparable to large dinosaurs. Large terrestrial organisms are the least likely of all to be preserved as they have to be completely buried very quickly. This means that the titans from the movie will struggle to be preserved in any semblance of a complete life assemblage. Dinosaurs are only preserved because a tiny amount of them died in the correct conditions to be preserved, and since they had reasonable populations instead of just a couple being alive at any one time and were around for the entirety of the Mesozoic.",
                "sceneDetails": "**Key Scenes:**\n• Exploration of massive underground caverns\n• Visualization of theoretical Earth structures\n• Depiction of underground geological formations\n\n**Technical Details:**\nWhile scientifically inaccurate, the film's interpretation of Earth's internal structure provides an imaginative view of theoretical underground worlds."
            }
        }
    ]
}
